CFE_project_builder_1C/Catalogs/сп_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>сп_Команды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сп_Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CFE_project_builder_1C/Catalogs/сп_Команды/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ДанныеКоманды() Экспорт 

	ДанныеКоманды = Новый Структура;
	ДанныеКоманды.Вставить("Команда", Неопределено);
	ДанныеКоманды.Вставить("НаборКоманд", Новый Массив);
	
	Возврат ДанныеКоманды;
	
КонецФункции

Функция Команда(ДанныеКоманды) Экспорт 

	Если ДанныеКоманды.НаборКоманд.Количество() = 0 Тогда
		Возврат ДанныеКоманды.Команда;
	КонецЕсли;
	
	СоставКоманды = Новый Массив;
	Для каждого Команда Из ДанныеКоманды.НаборКоманд Цикл
		СоставКоманды.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Команда, "Команда"));
	КонецЦикла;
	
	Возврат СтрСоединить(СоставКоманды, " ");
	
КонецФункции

Процедура ЗаполнитьПредопределенныеКоманды() Экспорт 
	
	//////////////////////////////
	Менеджер = Справочники.сп_Команды;

	//////////////////////////////
	ИзменитьКоманду(Менеджер.ВыгрузитьКонфигурациюВФайлы,	"/DumpConfigToFiles ""#$КаталогСборки$#\cf""");
	ИзменитьКоманду(Менеджер.ВыгрузитьКонфигурациюРасширенияВФайлы,	"/DumpConfigToFiles ""#$КаталогСборки$#\cfe#$ИмяРасширения$#""");
	ИзменитьКоманду(Менеджер.ЗапрещатьОтображениеДиалогов,	"/DisableStartupDialogs");
	ИзменитьКоманду(Менеджер.Логирование,	"/Out ""#$КаталогЛогФайлов$#"" -NoTruncate");
	ИзменитьКоманду(Менеджер.ОбновитьКонфигурациюИзХранилища,	"/ConfigurationRepositoryUpdateCfg");
	ИзменитьКоманду(Менеджер.ОбновлениеКонфигурацииБазыДанных,	"/UpdateDBCfg");
	ИзменитьКоманду(Менеджер.ПодключениеККлиентСервернойБазе,	"/S ""#$ИмяСервера$#\#$ИмяБазы$#"" /N ""#$ИмяПользователя$#"" /P ""#$ПарольПользователя$#"" /WA+");
	ИзменитьКоманду(Менеджер.ПодключениеКФайловойБазе,	"/F ""#$КаталогИнформационнойБазы$#"" /N ""#$ИмяПользователя$#"" /P ""#$ПарольПользователя$#"" /WA+");
	ИзменитьКоманду(Менеджер.ПодключениеКХранилищу, "/ConfigurationRepositoryF ""#$КаталогХранилища$#"" /ConfigurationRepositoryN ""#$ИмяПользователяХранилища$#"" /ConfigurationRepositoryP ""#$ПарольПользователяХранилища$#"" /ConfigurationRepositoryBindCfg");
	ИзменитьКоманду(Менеджер.ПодключениеКХранилищуРасширения,	"/ConfigurationRepositoryF ""#$КаталогХранилища$#"" /ConfigurationRepositoryN ""#$ИмяПользователяХранилища$#"" /ConfigurationRepositoryP ""#$ПарольПользователяХранилища$#"" /ConfigurationRepositoryBindCfg");
	ИзменитьКоманду(Менеджер.ПодключениеККлиентСервернойБазеDEV,	"/S ""#$ИмяСервераDEV$#\#$ИмяБазыDEV$#"" /N ""#$ИмяПользователяDEV$#"" /P ""#$ПарольПользователяDEV$#"" /WA+");
	ИзменитьКоманду(Менеджер.ПодключениеКФайловойБазеDEV,	"/F ""#$КаталогИнформационнойБазыDEV$#"" /N ""#$ИмяПользователяDEV$#"" /P ""#$ПарольПользователяDEV$#"" /WA+");
	ИзменитьКоманду(Менеджер.ПодключениеКХранилищуDEV, "/ConfigurationRepositoryF ""#$КаталогХранилищаDEV$#"" /ConfigurationRepositoryN ""#$ИмяПользователяХранилищаDEV$#"" /ConfigurationRepositoryP ""#$ПарольПользователяХранилищаDEV$#"" /ConfigurationRepositoryBindCfg");
	ИзменитьКоманду(Менеджер.ПодключениеКХранилищуРасширенияDEV,	"/ConfigurationRepositoryF ""#$КаталогХранилищаDEV$#"" /ConfigurationRepositoryN ""#$ИмяПользователяХранилищаDEV$#"" /ConfigurationRepositoryP ""#$ПарольПользователяХранилищаDEV$#"" /ConfigurationRepositoryBindCfg");
	ИзменитьКоманду(Менеджер.РежимЗапускаКонфигуратор,	"""#$Программа$#"" DESIGNER");
	ИзменитьКоманду(Менеджер.ИмяРасширения, "-Extension ""#$ИмяРасширения$#""");
	ИзменитьКоманду(Менеджер.СозданиеИнформационнойБазы, """#$Программа$#"" CREATEINFOBASE File=""#$КаталогСборки$#\build_cf_cfe\base""");
	ИзменитьКоманду(Менеджер.КаталогБазыСборки, "/F ""#$КаталогСборки$#\build_cf_cfe\base""");
	ИзменитьКоманду(Менеджер.ЗагрузкаКонфигурацииИзФайлов, "/LoadConfigFromFiles ""#$КаталогСборки$#\cf""");
	ИзменитьКоманду(Менеджер.ЗагрузкаКонфигурацииРасширенияИзФайлов, "/LoadConfigFromFiles ""#$КаталогСборки$#\cfe#$ИмяРасширения$#""");
	ИзменитьКоманду(Менеджер.ВыгрузкаКонфигурацииCF, "/DumpDBCfg ""#$КаталогСборки$#\build_cf_cfe\main.cf""");
	ИзменитьКоманду(Менеджер.ВыгрузкаКонфигурацииРасширениCFE, "/DumpDBCfg ""#$КаталогСборки$#\build_cf_cfe\#$ИмяРасширения$#.cfe"" -Extension ""#$ИмяРасширения$#""");
	ИзменитьКоманду(Менеджер.ОчиститьКаталогСборки, "del /s /q ""#$КаталогСборки$#\build_cf_cfe\base\*""");
	
	//////////////////////////////
	ИзменитьКоманду(Менеджер.Add, "git -C ""#$КаталогСборки$#"" add .");
	ИзменитьКоманду(Менеджер.BranchDEV, "git -C ""#$КаталогСборки$#"" branch dev");
	ИзменитьКоманду(Менеджер.CheckoutMaster, "git -C ""#$КаталогСборки$#"" checkout master");
	ИзменитьКоманду(Менеджер.CheckoutDEV, "git -C ""#$КаталогСборки$#"" checkout dev");
	ИзменитьКоманду(Менеджер.CommitAM, "git -C ""#$КаталогСборки$#"" commit -am ""#$комментарий$#""");
	ИзменитьКоманду(Менеджер.Commit, "git -C ""#$КаталогСборки$#"" commit -m ""#$комментарий$#""");
	ИзменитьКоманду(Менеджер.CoreAutocrlfTrue, "git -C ""#$КаталогСборки$#"" config core.autocrlf false");
	ИзменитьКоманду(Менеджер.CoreQuotepathFalse, "git -C ""#$КаталогСборки$#"" config core.quotepath false");
	ИзменитьКоманду(Менеджер.MergeMaster, "git -C ""#$КаталогСборки$#"" merge master");
	ИзменитьКоманду(Менеджер.Mergetool, "git -C ""#$КаталогСборки$#"" mergetool #$имя_файла_конфликта$#");
	ИзменитьКоманду(Менеджер.Status, "git -C ""#$КаталогСборки$#"" status");
	ИзменитьКоманду(Менеджер.Init, "git -C ""#$КаталогСборки$#"" init");
	ИзменитьКоманду(Менеджер.MergeToolKdiff3, "git -C ""#$КаталогСборки$#"" config merge.tool kdiff3"); 
	ИзменитьКоманду(Менеджер.MergetoolKdiff3Path, "git -C ""#$КаталогСборки$#"" config mergetool.kdiff3.path ""#$ИнструментРазрешенияКонфликтовПрограмма$#"""); 
	ИзменитьКоманду(Менеджер.MergetoolKdiff3KeepBackup, "git -C ""#$КаталогСборки$#"" config mergetool.kdiff3.keepBackup false");
	ИзменитьКоманду(Менеджер.DelLocRep, "rmdir /s /q ""#$КаталогСборки$#\.git""");
	ИзменитьКоманду(Менеджер.ResetHard, "git -C ""#$КаталогСборки$#"" reset --hard");
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазе);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ПодключениеКХранилищу);
	НаборКоманд.Добавить(Менеджер.ОбновитьКонфигурациюИзХранилища);
	НаборКоманд.Добавить(Менеджер.ОбновлениеКонфигурацииБазыДанных);
	
	ИзменитьКоманду(Менеджер.Команда1С_ОбновлениеИБИзХранилища, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазе);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ПодключениеКХранилищуРасширения);
	НаборКоманд.Добавить(Менеджер.ОбновитьКонфигурациюИзХранилища);
	НаборКоманд.Добавить(Менеджер.ИмяРасширения);
	НаборКоманд.Добавить(Менеджер.ОбновлениеКонфигурацииБазыДанных);
	
	ИзменитьКоманду(Менеджер.Команда1С_ОбновлениеИБИзХранилищаРасширения, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазе);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ПодключениеКХранилищу);
	НаборКоманд.Добавить(Менеджер.ВыгрузитьКонфигурациюВФайлы);

	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузитьКонфигурациюВФайлы, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазе);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ПодключениеКХранилищуРасширения);
	НаборКоманд.Добавить(Менеджер.ВыгрузитьКонфигурациюРасширенияВФайлы);
	НаборКоманд.Добавить(Менеджер.ИмяРасширения);

	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузитьКонфигурациюРасширенияВФайлы, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазеDEV);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ВыгрузитьКонфигурациюВФайлы);

	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузитьКонфигурациюВФайлыDEV, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.ПодключениеККлиентСервернойБазеDEV);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ВыгрузитьКонфигурациюРасширенияВФайлы);
	НаборКоманд.Добавить(Менеджер.ИмяРасширения);

	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузитьКонфигурациюРасширенияВФайлыDEV, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.СозданиеИнформационнойБазы);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);

	ИзменитьКоманду(Менеджер.Команда1С_ПодготовитьКаталогСборки, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ЗагрузкаКонфигурацииИзФайлов);

	ИзменитьКоманду(Менеджер.Команда1С_ЗагрузитьКонфигурациюCF, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование); 
	НаборКоманд.Добавить(Менеджер.ЗагрузкаКонфигурацииРасширенияИзФайлов);
	НаборКоманд.Добавить(Менеджер.ИмяРасширения);

	ИзменитьКоманду(Менеджер.Команда1С_ЗагрузитьКонфигурациюРасширенияCFE, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ОбновлениеКонфигурацииБазыДанных);
	
	ИзменитьКоманду(Менеджер.Команда1С_ОбновлениеИБ, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ОбновлениеКонфигурацииБазыДанных);
	НаборКоманд.Добавить(Менеджер.ИмяРасширения);
	
	ИзменитьКоманду(Менеджер.Команда1С_ОбновлениеИБРасширения, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ВыгрузкаКонфигурацииCF);
	
	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузкаКонфигурацииCF, НаборКоманд);
	
	//////////////////////////////
	НаборКоманд = Новый Массив;
	НаборКоманд.Добавить(Менеджер.РежимЗапускаКонфигуратор);
	НаборКоманд.Добавить(Менеджер.КаталогБазыСборки);
	НаборКоманд.Добавить(Менеджер.ЗапрещатьОтображениеДиалогов);
	НаборКоманд.Добавить(Менеджер.Логирование);
	НаборКоманд.Добавить(Менеджер.ВыгрузкаКонфигурацииРасширениCFE);
	
	ИзменитьКоманду(Менеджер.Команда1С_ВыгрузкаКонфигурацииРасширениCFE, НаборКоманд);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьКоманду(ТекСсылка, Команды)

	ТекОбъект = ТекСсылка.ПолучитьОбъект();
	ТекОбъект.Команда = Неопределено;
	ТекОбъект.НаборКоманд.Очистить();
	
	Если ТипЗнч(Команды) = Тип("Массив") Тогда
		Для каждого Команда Из Команды Цикл
			НовСтрока = ТекОбъект.НаборКоманд.Добавить();
			НовСтрока.Команда = Команда;
		КонецЦикла;
	Иначе 
		ТекОбъект.Команда = Команды;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекОбъект);

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
